[{"q":"What gets wet while it dries?","a":"towel"},{"q":"What has to be broken before you can use it?","a":"egg"},{"q":"What do I have in my pocket?","a":"string"},{"q":"What does a cat have that no other animal has?","a":"kittens"},{"q":"What always sleeps with its shoes on?","a":"horse"},{"q":"What can honk without a horn?","a":"goose"},{"q":"What has a horn but does not honk?","a":"rhino"},{"q":"What is higher without the head, than with it?","a":"pillow"},{"q":"What invention lets you look right through a wall?","a":"window"},{"q":"What has four legs, but cannot walk?","a":"table"},{"q":"What has a bark, but no bite?","a":"tree"},{"q":"What can clap without any hands?","a":"thunder"},{"q":"What wears a jacket, but no pants?","a":"book"},{"q":"What is made of wood, but cannot be sawed?","a":"sawdust"},{"q":"What flies around all day but never goes anywhere?","a":"flag"},{"q":"What has a hundred limbs, but cannot walk?","a":"tree"},{"q":"What room is never entered?","a":"mushroom"},{"q":"What gets beaten, and whipped, but never cries?","a":"egg"},{"q":"I have no bones and no legs, but if you keep me warm, I will soon walk away. What am I?","a":"egg"},{"q":"What kind of cup cannot hold water?","a":"cupcake"},{"q":"What has a foot but no legs??","a":"snail"},{"q":"I can sizzle like bacon, I am made with an egg, I have plenty of backbone, but lack a good leg. I peel layers like onions, but still remain whole; I can be long, like a flagpole, yet fit in a hole.  What am I?","a":"snake"},{"q":"Poor people have it. Rich people need it. If you eat it you die. What is it?","a":"nothing"},{"q":"What comes down but never goes up?","a":"rain"},{"q":"I am tall when I am young and I am short when I am old. What am I?","a":"candle"},{"q":"What goes up when rain comes down?","a":"umbrella"},{"q":"If I drink, I die. If i eat, I am fine. What am I?","a":"fire"},{"q":"What word becomes shorter when you add two letters to it?","a":"short"},{"q":"What travels around the world but stays in one spot?","a":"stamp"},{"q":"What occurs once in a minute, twice in a moment and never in one thousand years?","a":"m"},{"q":"What has 4 eyes but cannot see?","a":"mississippi"},{"q":"If I have it, I do not share it. If I share it, I do not have it. What is it?","a":"secret"},{"q":"Take away my first letter, and I still sound the same. Take away my last letter, I still sound the same. Even take away my letter in the middle, I will still sound the same. I am a five letter word. What am I?","a":"empty"},{"q":"What has hands but can not clap?","a":"clock"},{"q":"What can you catch but not throw?","a":"cold"},{"q":"What is at the end of a rainbow?","a":"w"},{"q":"What is as light as a feather, but even the world’s strongest man couldn’t hold it for more than a minute?","a":"breath"},{"q":"What starts with the letter t, is filled with t and ends in t?","a":"teapot"},{"q":"What is so delicate that saying its name breaks it?","a":"silence"},{"q":"You walk into a room with a match, a karosene lamp, a candle, and a fireplace. Which do you light first?","a":"match"},{"q":"What goes up and never comes down","a":"age"},{"q":"What kind of tree can you carry in your hand?","a":"palm"},{"q":"What has one eye but cannot see?","a":"needle"},{"q":"You will always find me in the past. I can be created in the present, But the future can never taint me. What am I?","a":"history"},{"q":"The more you take, the more you leave behind. What am I?","a":"footsteps"},{"q":"A seven letter word containing thousands of letters","a":"mailbox"},{"q":"Wednesday, Tom and Joe went to a restaurant and ate dinner.  When they were done they paid for the food and left. But Tom and Joe didn't pay for the food. Who did?","a":"wednesday"},{"q":"Mr. Smith has 4 daughters. Each of his daughters has a brother. How many children does Mr. Smith have?","a":"5"},{"q":"What begins with T, ends with T and has T in it?","a":"teapot"},{"q":"I'm tall when I'm young, I'm short when I'm old. What am I?","a":"pencil"},{"q":"I can bring tears to your eyes; resurrect the dead, make you smile, and reverse time.  I form in an instant but I last a lifetime. What am I?","a":"memory"},{"q":"If a green man lives in a green house,  a purple man lives in a purple house,  a blue man lives in a blue house,  a yellow man lives in a yellow house,  a black man lives in a black house.  Who lives in a White house?","a":"president"},{"q":"It can be cracked,  It can be made, It can be told, it can be played. What is it?","a":"jokes"},{"q":"What body part is pronounced as one letter but written with three, only two different letters are used?","a":"eye"},{"q":"What gets broken without being held?","a":"promise"},{"q":"Teddy bears are never hungry because they are always what?","a":"stuffed"},{"q":"Take off my skin - I won't cry, but you will! What am I?","a":"An onion"},{"q":"What never asks questions but is always answered. What am I?","a":"doorbell"},{"q":"Mary's father has 4 children; three are named Nana, Nene, and Nini. So what is the 4th child's name?","a":"mary "},{"q":"What type of house weighs the least?","a":"lighthouse"},{"q":"What gets whiter the dirtier it gets?","a":"chalkboard"},{"q":"If you were standing directly on the south pole facing north, which direction would you travel if you took one step backward?","a":"north"},{"q":"What has a head, a tail, is brown, and has no legs?","a":"penny"},{"q":"What belongs to you but others use it more than you do?","a":"name"},{"q":"What is harder to catch the faster you run?","a":"breath"},{"q":"Which vehicle is spelled the same forwards and backwards?","a":"racecar"},{"q":"What is it that no man ever yet did see, which never was, but always is to be?","a":"tomorrow"},{"q":"What is black when you buy it, red when you use it, and gray when you throw it away?","a":"charcoal"},{"q":"It is an insect, and the first part of its name is the name of another insect. What is it?","a":"beetle"},{"q":"What time of day, when written in a capital letters, is the same forwards, backwards and upside down?","a":"noon"},{"q":"I know a word; six letters it contains. And yet if you take one away, twelve is what remains.","a":"Dozen"},{"q":"What English word has three consecutive double letters?","a":"bookkeeper"},{"q":"What word looks the same upside down and backwards?","a":"swims"},{"q":"What goes through a door but never goes in and never comes out?","a":"keyhole"},{"q":"What's the difference between here and there?","a":"t"},{"q":"Thousands lay up gold within this house,But no man made it.Spears past counting guard this house,But no man wards it.","a":"beehive"},{"q":"Lives without a body, hears without ears, speaks without a mouth, to which the air alone gives birth. What is it?","a":"echo"},{"q":"This old one runs forever, but never moves at all. He has not lungs nor throat, but still a mighty roaring call. What is it?","a":"waterfall"},{"q":"What is round on both ends and hi in the middle?","a":"ohio"},{"q":"What is it that no one wants,but no one wants to lose?","a":"lawsuit"},{"q":"There is bomb on top of a computer; around the computer are a hairbrush, keys, phone and a cup. When the explosion comes, what item destroyed first?","a":"bomb"},{"q":"You are in a room with 3 monkeys. One monkey has a banana, one has a stick, and one has nothing. Who is the smartest primate?","a":"me"},{"q":"What kind of dog keeps the best time?","a":"watchdog"},{"q":"I have hands that wave you, though I never say goodbye. It's cool for you to be with me, especially when I say HI. What am I?","a":"fan"},{"q":"What tastes better than it smells?","a":"tongue"},{"q":"What do you get when you cross an automobile with a household animal?","a":"carpet"},{"q":"I cover what's real; hide what is true, but sometimes bring out the courage in you. What am I?","a":"makeup"},{"q":"There is a butcher, he is five feet ten inches tall, and he wears size 13 sneakers. What does he weigh?","a":"meat"},{"q":"I cannot hear or even see,but sense light and sounds there may be. Sometimes I end up on the hook, or even deep into a book. What am I?","a":"worm"},{"q":"This guy crossed a road and everyone wants an explanation. Who is it?","a":"chicken"},{"q":"What bone has a sense of humor?","a":"humorous"},{"q":"A blue house has blue bricks; a yellow house has a yellow bricks. What is a green house made of?","a":"glass"},{"q":"Who spends the day at the window, goes to the table for meals and hides at night?","a":"fly"},{"q":"The more there is the less you see","a":"Darkness"},{"q":"What number do you get when you multiply all of the numbers on a telephone's number pad?","a":"0"},{"q":"What disappears the moment you say its name?","a":"silence"},{"q":"I am lighter than air but a million men cannot lift me up, What am I?","a":"bubble"},{"q":"What is full of holes, but can still hold a lot of water?","a":"A sponge"},{"q":"Where everyone wants to run home and stealing is encouraged.","a":"baseball"},{"q":"What does no man want, yet no man want to lose?","a":"job"},{"q":"Though I should be unique, you've made most of us the same. I would be stronger, if my characters were stranger.","a":"password"},{"q":"I can be long, or I can be short. I can be grown, and I can be bought. I can be painted, or left bare. I can be round, or square. What am I?","a":"fingernails"},{"q":"I'm the part of the bird that's not in the sky. I can swim in the ocean and yet remain dry. What am I?","a":"shadow"},{"q":"I am a strong as ten men. Yet ten men cannot stand me up. What am I?","a":"water"},{"q":"I have a face, two arms, and two hands, yet I can not move. I count to twelve, yet I can not speak. I can still tell you something everyday.","a":"clock"},{"q":"When they are caught, they are thrown away. When they escape, you itch all day. What are they?","a":"fleas"},{"q":"What has 10 letters and starts with gas","a":"automobile"},{"q":"You can tumble in it, Roll in it, Burn it, Animals eat it, Used to cover floors, Still used beyond stall doors. Freshens whatever it is placed on, Absorbs whatever is poured into it. What is it?","a":"hay"},{"q":"What doesn't get any wetter, no matter how much rain falls on it?","a":"water"}]
